<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [4]:
import pandas as pd
import psycopg2

DBNAME = 'project_sql' # 'skillfactory'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:

query_3_1 = f'''
SELECT
    COUNT(*) "Количество вакансий"
FROM
    public.vacancies
'''

In [6]:

out_3_1=pd.read_sql_query(query_3_1,connection)
out_3_1

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1062992236.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_3_1=pd.read_sql_query(query_3_1,connection)

   Количество вакансий
0                49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:

query_3_2=f'''
SELECT
    COUNT(*) "Количество работодателей"
FROM public.employers
'''

In [8]:

out_3_2=pd.read_sql_query(query_3_2,connection)
out_3_2

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1034066664.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_3_2=pd.read_sql_query(query_3_2,connection)

   Количество работодателей
0                     23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
#мне кажется некорректно называть города регионами, вначале слегка запутался. Мало ли другие тож запутаются
query_3_3=f'''
SELECT
    COUNT(*) "Количество регионов"
FROM
    public.areas
'''

In [10]:
out_3_3=pd.read_sql_query(query_3_3,connection)
out_3_3

C:\Users\user\AppData\Local\Temp\ipykernel_3004\3048143246.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_3_3=pd.read_sql_query(query_3_3,connection)

   Количество регионов
0                 1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
query_3_4=f'''
SELECT
    count(id) "Количество сфер деятельности"
FROM
    public.industries
'''

In [12]:
out_3_4=pd.read_sql_query(query_3_4,connection)
out_3_4

C:\Users\user\AppData\Local\Temp\ipykernel_3004\179187807.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_3_4=pd.read_sql_query(query_3_4,connection)

   Количество сфер деятельности
0                           294

Компаний много, но и вакансий немало. В среднем в каждую компанию требуется закрыть 2-3 вакансии
***

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
query_4_1=f'''
SELECT
    a.name area,
    COUNT(v.*) cnt
FROM
    public.areas a
    JOIN
        public.vacancies v
        ON a.id=v.area_id
GROUP BY a.name
ORDER BY 2 DESC
'''

In [14]:
out_4_1=pd.read_sql_query(query_4_1,connection)
out_4_1

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1442649358.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_4_1=pd.read_sql_query(query_4_1,connection)

                area   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
query_4_2=f'''
SELECT
    COUNT(*) "Кол-во вакансий с указанной ЗП"
FROM
    public.vacancies
WHERE (salary_from IS NOT NULL)
    OR (salary_to IS NOT NULL)
'''

In [16]:
out_4_2=pd.read_sql_query(query_4_2,connection)
out_4_2

C:\Users\user\AppData\Local\Temp\ipykernel_3004\4160009191.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_4_2=pd.read_sql_query(query_4_2,connection)

   Кол-во вакансий с указанной ЗП
0                           24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
query_4_3=f'''
SELECT
    ROUND(AVG(salary_from)) "Ср.значение по низу",
    ROUND(AVG(salary_to)) "Ср.значение по верху"
FROM
    public.vacancies 
'''

In [18]:
out_4_3=pd.read_sql_query(query_4_3,connection)
out_4_3

C:\Users\user\AppData\Local\Temp\ipykernel_3004\915483038.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_4_3=pd.read_sql_query(query_4_3,connection)

   Ср.значение по низу  Ср.значение по верху
0              71065.0              110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
query_4_4=f'''
SELECT
    schedule,
    employment,
    count(*)
FROM
    public.vacancies
GROUP BY
    schedule, employment
ORDER BY 3 DESC
'''

In [20]:
out_4_4=pd.read_sql_query(query_4_4,connection)
out_4_4

C:\Users\user\AppData\Local\Temp\ipykernel_3004\429533517.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_4_4=pd.read_sql_query(query_4_4,connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
query_4_5=f'''
SELECT
    experience,
    count(*)
FROM public.vacancies
GROUP BY
    experience
ORDER BY 2 ASC
'''

In [22]:
out_4_5=pd.read_sql_query(query_4_5,connection)
out_4_5

C:\Users\user\AppData\Local\Temp\ipykernel_3004\2817437531.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_4_5=pd.read_sql_query(query_4_5,connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

Основное количество работодателей конечно ж находится в Москве и в других крупных городах (по убыванию). Работодатель в массе своей хочет сотрудника на полный рабочий день с присутствием на месте. По опыту работы лидируют вакансии с опытом работы от 1 до 3 лет, само собой работодатель не желает обучать человека с ноля, что логично. А более опытных людей компании знают и без хэдхантера

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [23]:
query_5_1=f'''
(SELECT
e.name,
count(v.*)
FROM
    public.employers e
    JOIN
        public.vacancies v
        ON v.employer_id=e.id
GROUP BY
    e.name
ORDER BY 2 DESC
LIMIT 1)

UNION

(SELECT
e.name,
count(v.*)
FROM
    public.employers e
    JOIN
        public.vacancies v
        ON v.employer_id=e.id
GROUP BY
    e.name
ORDER BY 2 DESC
OFFSET 4 LIMIT 1
)
ORDER BY 2 DESC
'''

In [24]:
out_5_1=pd.read_sql_query(query_5_1,connection)
out_5_1

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1192288043.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_5_1=pd.read_sql_query(query_5_1,connection)

            name  count
0         Яндекс   1933
1  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.

In [25]:

query_5_2=f'''
SELECT
    a.name,
    count(e.id) cnt_emp,
    count(v.id) cnt_vac
FROM
    public.areas a
LEFT JOIN
    public.employers e
    on a.id=e.area
LEFT JOIN
    public.vacancies v
    on a.id=v.area_id
GROUP BY
    a.name
ORDER BY 1
'''

In [26]:
out_5_2=pd.read_sql_query(query_5_2,connection)
display(out_5_2)

C:\Users\user\AppData\Local\Temp\ipykernel_3004\898307964.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_5_2=pd.read_sql_query(query_5_2,connection)

                              name  cnt_emp  cnt_vac
0                           Абакан      481      481
1                             Абан        0        1
2                         Абатское        0        0
3                         Абдулино        0        1
4                           Абинск       12       12
...                            ...      ...      ...
1357                        Ярцево        0        2
1358                     Ясногорск        0        2
1359  Ясный (Оренбургская область)        0        0
1360                        Яшкино        0        0
1361                            Яя        0        1

[1362 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [27]:
query_5_3=f'''
SELECT
    vacancies.employer_id,
    employers.name,
    COUNT(DISTINCT vacancies.area_id) cnt_regions
FROM public.employers
JOIN
    public.vacancies
    on employers.id=vacancies.employer_id
GROUP BY
    vacancies.employer_id, employers.name
ORDER BY 3 DESC
'''

In [28]:
out_5_3=pd.read_sql_query(query_5_3,connection)
out_5_3

C:\Users\user\AppData\Local\Temp\ipykernel_3004\3469484487.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_5_3=pd.read_sql_query(query_5_3,connection)

       employer_id                                    name  cnt_regions
0             1740                                  Яндекс          181
1             2748                              Ростелеком          152
2          5724811                              Спецремонт          116
3          5130287                  Поляков Денис Иванович           88
4          3682876                               ООО ЕФИН            71
...            ...                                     ...          ...
14901       810278                            НПП Авиатрон            1
14902       810313              Центр дистанционных торгов            1
14903       810551  Городские Телекоммуникационные Системы            1
14904       810688                       Введенский, Отель            1
14905       811902              Группа Компаний Автоимпорт            1

[14906 rows x 3 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [29]:
query_5_4=f'''
SELECT
COUNT(*)
FROM
    public.employers e
LEFT JOIN
    public.employers_industries ei
    ON e.id=ei.employer_id
WHERE
    ei.industry_id is null
'''

In [30]:
out_5_4=pd.read_sql_query(query_5_4,connection)
out_5_4

C:\Users\user\AppData\Local\Temp\ipykernel_3004\2114433030.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_5_4=pd.read_sql_query(query_5_4,connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [31]:
query_5_5=f'''
SELECT
    e.name,
    COUNT(ei.industry_id) count
FROM
    public.employers_industries ei
JOIN
    public.employers e
    ON ei.employer_id=e.id
GROUP BY
    e.name
HAVING COUNT(ei.industry_id)=4
ORDER BY 1
OFFSET 2
LIMIT 1
'''

In [32]:
out_5_5=pd.read_sql_query(query_5_5, connection)
out_5_5

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1244162333.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_5_5=pd.read_sql_query(query_5_5, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [33]:
query_5_6=f'''
SELECT
    COUNT(*)
FROM
    industries i
JOIN
    public.employers_industries ei
    ON i.id=ei.industry_id
WHERE i.name = 'Разработка программного обеспечения'
'''

In [34]:
out_5_6=pd.read_sql_query(query_5_6, connection)
out_5_6

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1094132940.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_5_6=pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8).

In [35]:
import requests
from bs4 import BeautifulSoup

url='https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response=requests.get(url)
page=BeautifulSoup(response.text,'html.parser')

cities_here=str(page.find('table', class_="standard"))
cities_here=cities_here.split('title="')[3:]
cities=[]
for i in cities_here:
    cities.append(i.split('">')[0])
# cities - список миллионников

In [36]:
query_5_7=f'''
(SELECT
    a.name region,
    COUNT(*)
FROM
    public.vacancies v
JOIN
    public.employers e
    ON v.employer_id=e.id

JOIN
    public.areas a
    ON a.id=v.area_id
WHERE
    e.name='Яндекс'
GROUP BY a.name
HAVING a.name in {tuple(cities)})

UNION

(SELECT
    'Total',
    COUNT(*)
FROM
    public.vacancies v
JOIN
    public.employers e
    ON v.employer_id=e.id

JOIN
    public.areas a
    ON a.id=v.area_id
WHERE
    e.name='Яндекс'
AND a.name in {tuple(cities)})
ORDER BY 2 ASC
'''

In [37]:
out_5_7=pd.read_sql_query(query_5_7, connection)
out_5_7

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1435147251.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_5_7=pd.read_sql_query(query_5_7, connection)

             region  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            Total    485

***

Чем крупнее город, тем больше вакансий требуется в компании. Яндекс лидирует в России

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [38]:
query_6_1=f'''
SELECT
    COUNT(*)
FROM
    public.vacancies
WHERE
    LOWER(name) LIKE '%data%'
    OR LOWER(name) LIKE '%данн%'
'''

In [39]:
out_6_1=pd.read_sql_query(query_6_1,connection)
out_6_1

C:\Users\user\AppData\Local\Temp\ipykernel_3004\2340747296.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_6_1=pd.read_sql_query(query_6_1,connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [40]:
query_6_2=f'''
SELECT
COUNT(*) "Кол-во вакансий"
FROM
    public.vacancies
WHERE
    (
        LOWER(name) LIKE '%data%scientist%'
        OR LOWER(name) LIKE '%data%science%'
        OR LOWER(name) LIKE '%ml%'
        OR LOWER(name) LIKE '%machine%learning%'
        OR LOWER(name) LIKE '%машинн%обучен%'
    )
    AND
        LOWER(name) NOT LIKE '%html%'
    AND (
        LOWER(name) LIKE '%junior%'
        OR LOWER(experience) LIKE '%нет%опыта%'
        OR LOWER(employment) LIKE '%стажировка%'
        )

'''

In [41]:
out_6_2=pd.read_sql_query(query_6_2,connection)
out_6_2

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1475637855.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_6_2=pd.read_sql_query(query_6_2,connection)

   Кол-во вакансий
0               51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [42]:
query_6_3=f'''
SELECT
COUNT(*) "Кол-во вакансий"
FROM
    public.vacancies
WHERE
    (
        LOWER(name) LIKE '%data%scientist%'
        OR LOWER(name) LIKE '%data%science%'
        OR name LIKE '%ML%'
        OR LOWER(name) LIKE '%machine%learning%'
        OR LOWER(name) LIKE '%машинн%обучен%'
    )
    AND
        LOWER(name) NOT LIKE '%html%'
AND
    (LOWER(key_skills) LIKE '%sql%'
    or LOWER(key_skills) LIKE '%postgres%'
    )
'''

In [43]:
out_6_3=pd.read_sql_query(query_6_3,connection)
out_6_3

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1693816850.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_6_3=pd.read_sql_query(query_6_3,connection)

   Кол-во вакансий
0              201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [44]:
query_6_4=f'''
SELECT
COUNT(*) "Кол-во вакансий"
FROM
    public.vacancies
WHERE
    (
        LOWER(name) LIKE '%data%scientist%'
        OR LOWER(name) LIKE '%data%science%'
        OR name LIKE '%ML%'
        OR LOWER(name) LIKE '%machine%learning%'
        OR LOWER(name) LIKE '%машинн%обучен%'
    )
    AND
        LOWER(name) NOT LIKE '%html%'
AND
    LOWER(key_skills) LIKE '%python%'
'''

In [45]:
out_6_4=pd.read_sql_query(query_6_4,connection)
out_6_4

C:\Users\user\AppData\Local\Temp\ipykernel_3004\2424236548.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_6_4=pd.read_sql_query(query_6_4,connection)

   Кол-во вакансий
0              351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [46]:
query_6_5=f'''
    SELECT
        ROUND(AVG(LENGTH(key_skills)-LENGTH(REPLACE(key_skills,'\t',''))+1),2)
    FROM
        public.vacancies
    WHERE
        (
        LOWER(name) LIKE '%data%scientist%'
        OR LOWER(name) LIKE '%data%science%'
        OR name LIKE '%ML%'
        OR LOWER(name) LIKE '%machine%learning%'
        OR LOWER(name) LIKE '%машинн%обучен%'
        )
    AND
        LOWER(name) NOT LIKE '%html%'
'''

In [47]:
out_6_5=pd.read_sql_query(query_6_5,connection)
out_6_5

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1540702469.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_6_5=pd.read_sql_query(query_6_5,connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [48]:
query_6_6=f'''
    with x as (
        SELECT
            experience,
            salary_from,
            salary_to
        FROM
            public.vacancies
        WHERE
            (
            LOWER(name) LIKE '%data%scientist%'
            OR LOWER(name) LIKE '%data%science%'
            OR name LIKE '%ML%'
            OR LOWER(name) LIKE '%machine%learning%'
            OR LOWER(name) LIKE '%машинн%обучен%'
            )
        AND
            LOWER(name) NOT LIKE '%html%'
        AND
            (
                salary_from IS NOT NULL
                OR
                salary_to IS NOT NULL
            )
        )
SELECT
    experience,
    ROUND(AVG((COALESCE(salary_from,salary_to)+COALESCE(salary_to,salary_from))/2)) average_salary
FROM
    x
GROUP BY
    experience
    
    '''

In [49]:
out_6_6=pd.read_sql_query(query_6_6,connection)
out_6_6

C:\Users\user\AppData\Local\Temp\ipykernel_3004\3654131210.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_6_6=pd.read_sql_query(query_6_6,connection)

           experience  average_salary
0       От 3 до 6 лет        243115.0
1  От 1 года до 3 лет        139675.0
2           Нет опыта         74643.0

***

In [50]:
query_6=f'''
(SELECT
    a.name,
    COUNT(*) count_ds
FROM
    public.vacancies v
    LEFT JOIN
        public.areas a
        ON v.area_id=a.id
WHERE
            (
            LOWER(v.name) LIKE '%data%scientist%'
            OR LOWER(v.name) LIKE '%data%science%'
            OR v.name LIKE '%ML%'
            OR LOWER(v.name) LIKE '%machine%learning%'
            OR LOWER(v.name) LIKE '%машинн%обучен%'
            )
        AND
            LOWER(v.name) NOT LIKE '%html%'
GROUP BY a.name
ORDER BY 2 DESC
LIMIT 10)
'''
out_6=pd.read_sql_query(query_6,connection)
out_6

C:\Users\user\AppData\Local\Temp\ipykernel_3004\1531030065.py:24: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  out_6=pd.read_sql_query(query_6,connection)

              name  count_ds
0           Москва       219
1  Санкт-Петербург        64
2      Новосибирск        23
3  Нижний Новгород        20
4           Казань        16
5           Алматы        16
6            Минск         9
7            Томск         8
8     Екатеринбург         7
9          Армения         6

# Общий вывод по проекту

In [51]:
total_query=f'''
with x as (
    SELECT
        a.name city,
        COUNT(*) count_ds
    FROM
        public.vacancies v
    LEFT JOIN
        public.areas a
        ON v.area_id=a.id
    WHERE
            (
            LOWER(v.name) LIKE '%data%scientist%'
            OR LOWER(v.name) LIKE '%data%science%'
            OR v.name LIKE '%ML%'
            OR LOWER(v.name) LIKE '%machine%learning%'
            OR LOWER(v.name) LIKE '%машинн%обучен%'
            )
        AND
            LOWER(v.name) NOT LIKE '%html%'
    GROUP BY a.name
),

y as (
    SELECT
        a.name city,
        COUNT(*) count_all
    FROM
        public.vacancies v
        LEFT JOIN
            public.areas a
        ON v.area_id=a.id
    GROUP BY a.name
)

SELECT
    x.city,
    count_ds,
    count_all,
    100*((count_ds)::float/(count_all)::float) percentage
FROM y
    LEFT JOIN
        x
        ON x.city=y.city
WHERE count_ds IS NOT NULL
ORDER BY percentage DESC
LIMIT 20
'''
total_out=pd.read_sql_query(total_query,connection)
total_out

C:\Users\user\AppData\Local\Temp\ipykernel_3004\937217981.py:49: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  total_out=pd.read_sql_query(total_query,connection)

               city  count_ds  count_all  percentage
0           Абхазия         1          1  100.000000
1           Израиль         2          2  100.000000
2             Чехия         2         14   14.285714
3            Сербия         3         26   11.538462
4             Литва         2         19   10.526316
5        Черногория         1         14    7.142857
6            Турция         2         39    5.128205
7            Москва       219       5333    4.106507
8              Кипр         5        136    3.676471
9         Иннополис         3         91    3.296703
10          Армения         6        223    2.690583
11  Санкт-Петербург        64       2851    2.244826
12             Баку         2         91    2.197802
13           Польша         1         53    1.886792
14          Королев         1         63    1.587302
15           Батуми         1         83    1.204819
16  Нижний Новгород        20       1670    1.197605
17            Томск         8        692    1.156069
18           Рязань         4        346    1.156069
19      Новосибирск        23       2006    1.146560

А здесь видно, что работодатели даже из других стран готовы взять в сотрудники специалистов DataScience, раз уж закинули свои вакансии в российский HH.ru,
значит направление аппетитно